//ramadan constants

export const TASK_ONE = [
  {
    id: 1,
    head_title: "السنن الرواتب",
    title: `هل أتممت صلاة سنن الرواتب؟`,
    points: 4,
    virtue_and_evidence: `قال الرسول صلى الله عليه وسلم:
( مَنْ صَلَّى اثْنَتَيْ عَشْرَةَ رَكْعَةً فِي يَوْمٍ وَلَيْلَةٍ بُنِيَ لَهُ بِهِنَّ بَيْتٌ فِي الْجَنَّةِ ) رواه مسلم (728)
`,
    important_clarifications: `أربعاً قبل الظهر وركعتين بعدها ,وركعتين بعد المغرب ,وركعتين بعد العشاء, وركعتين قبل الفجر`,
    model: `goldenForm.sunan_al_rawatib`,
    name: "sunan_al_rawatib",
  },

  {
    id: 2,
    head_title: "الاستغفار",
    title: `هل قمت بالاستغفار 100 مرة اليوم ؟`,
    points: 3,
    virtue_and_evidence: `قال الله تعالى:
    ( فَقُلْتُ اسْتَغْفِرُوا رَبَّكُمْ إِنَّهُ كَانَ غَفَّارًا . يُرْسِلِ السَّمَاءَ عَلَيْكُمْ مِدْرَارًا . وَيُمْدِدْكُمْ بِأَمْوَالٍ وَبَنِينَ وَيَجْعَلْ لَكُمْ جَنَّاتٍ وَيَجْعَلْ لَكُمْ أَنْهَارًا )`,
    important_clarifications: ``,
    model: "goldenForm.istighfar",
    name: "istighfar",
  },

  {
    id: 3,
    head_title: "التسبيح",
    title: `هل قمت بالتسبيح 100 مرة اليوم ؟`,
    points: 3,
    virtue_and_evidence: `قال رسول الله صلى الله عليه وسلم:
    (كلمتان خفيفتان على اللسان، ثقيلتان في الميزان، حبيبتان إلى الرحمن: سبحان الله وبحمده، سبحان الله العظيم) متفق عليه.`,
    important_clarifications: ``,
    model: "goldenForm.tasbeeh",
    name: "tasbeeh",
  },

  {
    id: 4,
    head_title: "صلاة الضحى",
    title: `هل صليت الضحى اليوم ؟`,
    points: 2,
    virtue_and_evidence: `قال رسول الله صلى الله عليه وسلم:
    لا يحافظ على صلاة الضحى إلا أواب وهي صلاة الأوابين`,
    important_clarifications: ``,
    model: "goldenForm.duha_prayer",
    name: "duha_prayer",
  },
  {
    id: 5,
    head_title: "أذكار الصباح والمساء",
    title: `هل قرأت أذكار الصباح والمساء لليوم ؟`,
    points: 4,
    virtue_and_evidence: `قال تعالى:
    فَاذْكُرُونِي أَذْكُـرْكُمْ وَاشْكُرُواْ لِي وَلاَ تَكْفُرُونِ‏
    قال تعالى:
    يَا أَيُّهَا الَّذِينَ آمَنُوا اذْكُرُوا اللَّهَ ذِكْرًا كَثِيرًا
    قال تعالى:
    وَاذْكُر رَّبَّكَ فِي نَفْسِكَ تَضَرُّعاً وَخِيفَةً وَدُونَ الْجَهْرِ مِنَ الْقَوْلِ بِالْغُدُوِّ وَالآصَالِ وَلاَ تَكُن مِّنَ الْغَافِلِينَ`,
    important_clarifications: ``,
    model: `goldenForm.morning_evening_dhikr`,
    name: "morning_evening_dhikr",
  },
  {
    id: 6,
    head_title: "الشفع والوتر",
    title: `هل صليت الشفع والوتر ؟`,
    points: 2,
    virtue_and_evidence: `قال تعالى :
    (وَالْفَجْرِ (1) وَلَيَالٍ عَشْرٍ (2) وَالشَّفْعِ وَالْوَتْرِ)
    قال صلى الله عليه وسلم :
    إنَّ اللهَ زادَكُم صلاةً, وهي الوِترُ, فصلُّوها بينَ صلاةِ العشاءِ إلى صلاةِ الفجرِ
    وقال ايضا:
    هي الصلاة بعضها شفع، وبعضها وتر`,
    important_clarifications: `الشفع هو الضم ومنه الشفع في الصلاة وهو ضم ركعة إلى ركعة وشفاعة النبي عليه الصلاة والسلام للمذنبين لأنها تضمهم للصالحين تكون صلاة الشفع زوجية من ركعتين أو أربع أو ست أما صلاة الوتر فتكون فردية    `,
    model: `goldenForm.shaf_and_witr`,
    name: "shaf_and_witr",
  },
];

export const TASK_TWO = [
  {
    id: 1,
    head_title: "السحور",
    title: `هل تسحرت اليوم ؟ `,
    points: 3,
    virtue_and_evidence: `قال الرسول صلى الله عليه وسلم:
    ((السُّحَوُرُ كُلَّهُ بَرَكَةٌ فَلَا تَدَعُوهُ, وَلَوْ أَنْ يَجْرَعَ أَحَدُكُم جَرْعَةً مِنْ مَاءٍ, فَإِنَّ اللَّهَ –عَزَّ وَجَلَّ- وَمَلائِكَتَهُ يُصَلُّونَ عَلَى المُتَسَحِّرِينَ)). رَوَاهُ أَحْمَد وَإِسْنَادُهُ قَوِيٌّ`,
    important_clarifications: ``,
    model: `goldenForm.suhoor`,
    name: "suhoor",
  },
  {
    id: 2,
    head_title: "شرب الماء",
    title: `هل قمت بشرب 5 كاسات ماء اليوم؟`,
    points: 3,
    virtue_and_evidence: `قال تعالى:
    وَجَعَلْنَا مِنَ الْمَاءِ كُلَّ شَيْءٍ حَيٍّ أَفَلا يُؤْمِنُونَ`,
    important_clarifications: `هل تعلم أن الماء يعمل على:
     - ازالة الرائحة الكريهة من الجسم
    - يساعد على فقدان الوزن (يساعد في عملية الهضم)
    - مرطب للجسم الكامل والبشرة`,
    model: `goldenForm.drink_water`,
    name: "drink_water",
  },
  {
    id: 3,
    head_title: "النوم",
    title: `ما هو مجموع ساعات نومك خلال اليوم ؟`,
    points: 2,
    virtue_and_evidence: ``,
    important_clarifications: `يحتاج الإنسان للنوم 8 ساعات في اليوم كحد أقصى و 4 ساعات كحد أدنى مما يمكنه القيام بما عليه بنشاط وشكل طبيعي، حيث بامكانه ان يوزع ساعات نومه خلال النهار ولكن لا تزيد عن 8 ولا تقل عن 4 حتى لا يتسبب له بالارهاق    `,
    model: `goldenForm.sleep_amount`,
    name: "sleep_amount",
  },
  {
    id: 4,
    head_title: "العناية بالأسنان",
    title: `هل قمت بتفريش أسنانك مرتين اليوم ؟ `,
    points: 2,
    virtue_and_evidence: `قال رسول الله صلى الله عليه وسلم:
    لولا أن أشق على أمتي لأمرتهم بالسواك عند كل صلاةَ`,
    important_clarifications: `للحفاظ على الأسنان لابد من التفريش سواء باستخدام السواك أو الفرشاة لمدة لا تقل عن دقيقتين مرتين في اليوم`,
    model: `goldenForm.brushing_teeth`,
    name: "brushing_teeth",
  },
];

export const TASK_THREE = [
  {
    id: 1,
    head_title: "التفكر في آيات الله",
    title: `هل تفكرت باية من أيات الله عز وجل ؟ `,
    points: 2,
    virtue_and_evidence: `قال تعالى:
    الَّذِينَ يَذْكُرُونَ اللَّهَ قِيَامًا وَقُعُودًا وَعَلَىٰ جُنُوبِهِمْ وَيَتَفَكَّرُونَ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ رَبَّنَا مَا خَلَقْتَ هَٰذَا بَاطِلًا سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ`,
    important_clarifications: `كانت عبادة التفكر دأب النبي صلى الله عليه وسلم وهو في غار حراء، حيث أن التفكر هو عبادة ربانية وضرورة دعوية    `,
    model: `goldenForm.contemplation_of_allahs_signs`,
    name: "contemplation_of_allahs_signs",
  },
];
