<template>
    <div class="row">
        <div class="col-sm-12">
            <iq-card>
                <template v-slot:body>
                    <div class="row p-3 mb-3 mt-3 ms-auto me-auto" style="direction: rtl;">
                        <div class="d-flex justify-content-between">
                            <h1>
                                السياسات والشروط والأحكام
                            </h1>
                            <back-button routeName="osboha.list"
                                :text="`الصفحة الرئيسية`" />

                        </div>

                        <hr>
                        <h5>
                            مرحبًا بك في منصة "أصبوحة 180"، المشروع الرائد في عالم القراءة والتعلم. يُرجى قراءة شروط
                            الاستخدام التالية بعناية قبل استخدام الموقع، حيث إن دخولك إلى الموقع واستخدامك له يتطلب منك
                            الموافقة على جميع الأحكام والشروط الواردة أدناه. باستخدامك لهذا الموقع، فإنك تقر وتوافق على
                            الالتزام بهذه السياسات.

                        </h5>

                        <p class="mt-3">
                            <strong class="text-danger">1. قبول الشروط :</strong>
                            <br>
                            بمجرد وصولك إلى الموقع واستخدامه، فإنك تقبل وتوافق على هذه الشروط والأحكام. إذا كنت لا توافق
                            على أي من هذه الشروط، يُرجى عدم استخدام الموقع.
                        </p>
                        <p>
                            <strong class="text-danger">2. الاستخدام المسموح به :</strong>
                        </p>
                        <ul>
                            <li>
                                <p> أ. الكتب الإلكترونية: يتيح لك الموقع الوصول إلى مجموعة واسعة من الكتب الإلكترونية
                                    المنشورة مسبقًا على مواقع اقتناء الكتب الإلكترونية. يُحظر عليك استخدام هذه الكتب
                                    لأغراض تجارية أو توزيعها أو نشرها دون إذن صريح من أصحاب الحقوق. نحن في "أصبوحة 180"
                                    نستخدم فقط الكتب المتاحة والمنشورة على الإنترنت لأغراض تعليمية، ونتعهد بحذف أي كتاب
                                    إذا طلب مالك الحقوق الفكرية ذلك.
                                </p>
                            </li>
                            <li>
                                <p> ب. مشاركة المحتوى: يمكنك مشاركة اليوميات والآراء الشخصية والدينية والسياسية عبر
                                    الموقع. يجب أن يكون المحتوى الذي تشاركه لائقًا وغير مسيء، ومتوافقًا مع القوانين
                                    واللوائح الخاصة بالموقع. يُمنع المساس بالدين الإسلامي ورموزه، وكذلك نشر أي آراء
                                    سياسية، طائفية، أو عرقية. يتحمل المستخدمون مسؤولية كاملة عن محتوى مشاركاتهم، ويجب أن
                                    تتماشى مع الشريعة الإسلامية والأخلاق العامة.
                                </p>
                            </li>
                        </ul>
                        <p>
                            <strong class="text-danger">3. حقوق الملكية الفكرية :</strong>
                            <br>
                            جميع المحتويات على الموقع، بما في ذلك فكرة المشروع، وتنظيم المسابقات والدورات، والملخصات
                            والمقاطع المصورة، والصور، والكتب الإلكترونية، والمقالات، والتعليقات، محمية بموجب قوانين حقوق
                            الملكية الفكرية. لا يُسمح لك بنسخ أو توزيع أو تعديل أو عرض أي محتوى من الموقع دون الحصول على
                            إذن
                            خطي مسبق. كما يمنع المشروع إزالة شعار المشروع من أي من منتجات أصبوحة 180 أو أحد أفرقتها،
                            كمثال
                            وليس الحصر، المقاطع المصورة والتصاميم البصرية ومقالات المشروع وشهادات التكريم وغيرها .
                        </p>
                        <p>
                            <strong class="text-danger">4. مسؤوليات المستخدمين:</strong>
                        </p>
                        <ul>
                            <li>
                                <p>
                                    أ. دقة المعلومات: يجب عليك التأكد من دقة المعلومات التي تقدمها عند استخدام الموقع.
                                    يُحظر تقديم معلومات كاذبة أو مضللة.

                                </p>
                            </li>
                            <li>
                                <p>
                                    ب. الاحترام: يجب أن تتسم مشاركاتك وآراؤك بالاحترام تجاه الآخرين. يُمنع نشر محتوى
                                    يحرض على الكراهية أو التمييز أو العنف أو إساءة الأدب. يجب احترام الشريعة الإسلامية
                                    والرموز الدينية والالتزام بالخلق القويم وتجنب أي مخالفات دينية.
                                </p>
                            </li>
                        </ul>

                        <p>
                            <strong class="text-danger">5. الاستخدام غير المسموح به : </strong>
                            <br>
                            يُحظر استخدام الموقع لأي نشاط غير قانوني أو ضار. يشمل ذلك، على سبيل المثال لا الحصر، نشر
                            محتوى محظور، أو الانخراط في أنشطة احتيالية، أو نشر مقاطع غير أخلاقية، أو إلحاق الضرر
                            بالأنظمة.
                        </p>
                        <p>
                            <strong class="text-danger">6. التعديلات على الشروط : </strong>
                            <br>
                            يحق لنا تعديل شروط الاستخدام هذه في أي وقت. سيتم نشر التعديلات على هذه الصفحة، ويعتبر
                            استمرارك في استخدام الموقع بعد نشر أي تعديلات موافقة منك على الشروط المعدلة.
                        </p>

                        <p>
                            <strong class="text-danger">7. إخلاء المسؤولية:</strong>
                        </p>
                        <ul>
                            <li>
                                <p>
                                    أ. يتم توفير الموقع كما هو دون أي تعديلات، ولا نتحمل مسؤولية أي أضرار أو خسائر قد
                                    تنجم عن استخدامك للموقع أو عدم قدرتك على الوصول إليه. لا يتحمل المشروع أي عواقب
                                    ناتجة عن سوء الفهم أو الاستخدام لما ينشر ويقدم من خدمات من قبل المستخدم.

                                </p>
                            </li>
                            <li>
                                <p>
                                    ب. تُقدم جميع الخدمات المتاحة عبر الموقع، بما في ذلك الكتب والدورات والورشات، بشكل
                                    مجاني تماماً ودون أي تكلفة مالية. لا تتحمل (أصبوحة 180) أي مسؤولية تجاه أي عمليات
                                    احتيال قد تحدث، بما في ذلك محاولات بيع دورات أو كتب أو خدمات منسوبة إلينا بشكل غير
                                    مصرح به. يُنصح المستخدمون بالتحقق من مصادر أي عروض أو منتجات تُعرض تحت اسمنا لضمان
                                    مصداقيتها.
                                </p>
                            </li>
                            <li>
                                <p>
                                    ج. يتولى مشروع أصبوحة مراقبة الأنشطة الخاصة بالقراء، ومسؤولي الفرق، والجهات الإدارية
                                    ضمن المشروع، ويقوم بمتابعتهم بشكل دائم لضمان تقديم أفضل مستويات الاحترام
                                    والاحترافية. ومع ذلك، لا يمكن للمشروع ضمان عدم حدوث سوء استخدام للسلطات من قبل أي من
                                    المسؤولين المشار إليهم، حيث إن أي تصرف غير لائق أو إساءة في استخدام السلطات تقع تحت
                                    مسؤولية الفرد المعني فقط ولا تعكس موقف أو سياسة مشروع أصبوحة. في حال تعرض المستخدم
                                    لأي سوء استخدام للسلطة، يحق له تقديم شكوى رسمية من خلال القنوات المتاحة في المشروع.

                                </p>
                            </li>
                            <li>
                                <p>
                                    د. يخلي مشروع صناعة القراء (أصبوحة 180) مسؤوليته عن أي سوء تفاهم أو إساءة قد تحدث
                                    بين
                                    الأعضاء على المستوى الشخصي داخل المشروع. ومع ذلك، يلتزم المشروع باتخاذ الإجراءات
                                    المناسبة لمحاسبة ومعاقبة أي فرد يثبت ارتكابه لسلوك متعمد يهدف إلى الإساءة للآخرين،
                                    أو التعدي على حياتهم الشخصية، الدينية، أو استغلالهم بأي شكل من الأشكال، بما في ذلك
                                    الأبعاد الجسدية، المالية، والفردية. يتم التعامل مع مثل هذه الحالات وفقاً للسياسات
                                    والإجراءات المعتمدة للمشروع. في حال تعرض أي شخص لمثل هذه المضايقات، يُطلب منه تقديم
                                    شكوى رسمية لإدارة المشروع عبر القنوات المخصصة لذلك

                                </p>
                            </li>
                        </ul>
                        <p>
                            <strong class="text-danger">8. التواصل معنا :</strong>
                            <br>
                            لأي استفسارات حول هذه الشروط والأحكام، يُرجى التواصل معنا عبر البريد الإلكتروني
                            [dr.ahmed@osboha180.com] أو من خلال النموذج المتاح على الموقع.

                        </p>

                        <h4 class="text-center mt-3">
                            شكرًا لزيارتك لمنصة "أصبوحة 180". نتمنى لك تجربة ممتعة ومفيدة!
                        </h4>

                    </div>
                    <div class="text-center mt-3">
                        <img src="@/assets/images/logo.png" class="img-fluid rounded" alt="logo-img" />
                    </div>

                </template>
            </iq-card>
        </div>
    </div>
</template>
<script>
import BackButton from '@/components/common/BackButton.vue';

export default {
    name: 'Terms and Conditions',
    components: {
        BackButton,
    },
    data() {
        return {

        }
    }
}
</script>
<style scoped>
h1,
h4,
p {
    direction: rtl;
}

ul {
    list-style-type: none;
}
</style>